// Запитати у користувача рік народження.
// Запитати в нього, в якому місті він живе.
// Запитати його улюблений вид спорту.
// При натисканні на ОК показуємо вікно, де має бути відображена наступна інформація:
// Його вік.
// Якщо користувач вкаже Київ, Вашингтон чи Лондон, то показати йому повідомлення - "Ти живеш у столиці..." і на місце точок підставляємо країну, столицею якої є місто. Інакше показуємо йому “ти живеш у місті…” і місце точок – введене місто.
// Вибираємо самі три види спорту та три чемпіони у цих видах. Відповідно, якщо користувач вкаже один із цих видів спорту, то показуємо йому повідомлення “Круто! Хочеш стати …? і підставляємо на місце точок ім'я та прізвище чемпіона.
// Все це має бути відображено в одному вікні (алерті).
// Якщо в якомусь випадку він не захоче вводити інформацію і натисне Скасувати, показати йому повідомлення – “Шкода, що Ви не захотіли ввести свій(ю) …” і вказуємо, що він не захотів вводити – дату народження, місто чи вид спорту .

let year = +prompt("В якому році ти народився: ", '');
let city = prompt("В якому населенному пункті ти проживаєш?: ", '');
let sport = prompt("Твій улюблений вид спорту: ", '');

const CURRENT_YEAR = 2022;

let old = CURRENT_YEAR - year;
let champion = '';

switch (city) {
    case 'Київ':
    case 'Вашингтон':
    case 'Лондон':
        city = `Ти живеш у столиці - ${city} `;
        break;
    default:
        city = `Ти живеш у місті - ${city}`;
}

switch (sport) {
    case 'Футбол':
        champion = `Андрій Шевченко`;
        break;
    case 'Бокс':
        champion = `Олександр Усік`;
        break;
    case 'Греко-римська боротьба':
        champion = `Жан Беленюк`;
        break;
    default:
        champion = `Підшукаємо чемпіона для цього віду спорту пізніше.`;
}

alert(`Твій вік: ${old} \n${city} \nКруто! Хочеш стати як ${champion} ?`)